@echo off
start ny.vbs
timeout 4 > nul
:loop


cls
color 0a
::FRAME 1
ECHO.
echo ллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл= Nyanya =лллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл
echo `                                               #                                                   
echo `                                             #   #                                                 
echo `                                               #                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `  #                                                                                                
echo `#   #                                                                                              
echo `  #                        #####################################                                   
echo --`````````---------```````#((((((((///////((((/(((((((((////////#                                  
echo `                         #(//                                 \/(#                                 
echo --`````````---------``````#(/   ##            ##    #####    ## \(#  #####                          
echo ..`````````.........###```#(                       #.....###     (###.....#                         
echo --`````````--------#(..*#`#(       ##              #........######........#                         
echo ccCCCCCCCCCcccccccc*#(..*##(                  ##  #........................#                        
echo --`````````---------*#(..*#(   ##                 #........................#                        
echo mmMMMMMMMMMmmmmmmmmmM*#(..#(                      #..... #........... #....#                        
echo --`````````---------``*####(         ##     ##    #.....#@...........#@....#                        
echo ..`````````.........``````#(\  ##                 #\.......#...#...#....../#                       #
echo --`````````---------``````#//\                     #\......*#######*...../#                         
echo ############################////(///((((/////((((((###\.............../###                          
echo --`````````---------``#(...(.##########################################                             
echo `                     #(..(##/#(..(#                  #/..(#   #/..(#                               
echo `                     #####   #####*                  *#####   *####*                               
echo `                                                                                                   
echo `                #                                                                                  
echo `                                                             #                                     
echo `           #         #                                       #                                     
echo `                                                         ###   ###                                 
echo `                #                                            #                                     
echo `                                                             #                                     
ping localhost -n 1 >nul
cls 

::FRAME 1
color 5
echo.
echo ллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл= Nyanya =лллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл
echo `                                               #                                                   
echo `                                             #   #                                                 
echo `                                               #                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `  #                                                                                                
echo `#   #                                                                                              
echo `  #                        #####################################                                   
echo --`````````---------```````#((((((((///////((((/(((((((((////////#                                  
echo `                         #(//                                 \/(#                                 
echo --`````````---------``````#(/   ##            ##    #####    ## \(#  #####                          
echo ..`````````.........###```#(                       #.....###     (###.....#                         
echo --`````````--------#(..*#`#(       ##              #........######........#                         
echo ccCCCCCCCCCcccccccc*#(..*##(                  ##  #........................#                        
echo --`````````---------*#(..*#(   ##                 #........................#                        
echo mmMMMMMMMMMmmmmmmmmmM*#(..#(                      #..... #........... #....#                        
echo --`````````---------``*####(         ##     ##    #.....#@...........#@....#                        
echo ..`````````.........``````#(\  ##                 #\.......#...#...#....../#                       #
echo --`````````---------``````#//\                     #\......*#######*...../#                         
echo ############################////(///((((/////((((((###\.............../###                          
echo --`````````---------``#(...(.##########################################                             
echo `                     #(..(##/#(..(#                  #/..(#   #/..(#                               
echo `                     #####   #####*                  *#####   *####*                               
echo `                                                                                                   
echo `                #                                                                                  
echo `                                                             #                                     
echo `           #         #                                       #                                     
echo `                                                         ###   ###                                 
echo `                #                                            #                                     
echo `                                                             #                                     
ping localhost -n 1 >nul
cls 

::FRAME 2
color 8
echo.
echo ллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл= Nyanya =лллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл
echo `                                            #                                                      
echo `                                          #   #                                                    
echo `                                            #                                                      
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo ` #                                                                                                 
echo `                           #####################################                                   
echo --`````````---------```````#((((((((///////((((/(((((((((////////#                                  
echo `                         #(//                                 \/(#                                 
echo --`````````---------``````#(/   ##            ##     #####   ## \(#   #####                         
echo ..`````````.........``````#(                        #.....###    (####.....#                        
echo --`````````--------###````#(       ##               #........######........#                        
echo ccCCCCCCCCCccccccc#(.*#####(                  ##   #........................#                       
echo --`````````-------##(((...#(   ##                  #........................#                       
echo mmMMMMMMMMMmmmmmmmm**##(((#(                       #..... #........... #....#                       
echo --`````````---------``*####(         ##     ##     #.....#@...........#@....#                       
echo ..`````````.........``````#(\  ##                  #\.......#...#...#....../#                   #   
echo --`````````---------``````#//\                      #\......*#######*...../#                        
echo ############################////(///((((/////((((((((###\............../###                         
echo --`````````---------```#/.(./##########################################                             
echo `                      #/.(/#/#(..(#                   #/..(#   #/..(#                              
echo `                      #####  *#####                   *#####   *#####                              
echo `                                                                                                   
echo `                                                          #                                        
echo `                                                          #                                        
echo `           #                                                                                       
echo `                                                     ###  #   ###                                  
echo `                                                                                                   
echo `                                                          #                                        
ping localhost -n 1 >nul
cls 

::FRAME 2
color 1
echo.
echo ллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл= Nyanya =лллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл
echo `                                            #                                                      
echo `                                          #   #                                                    
echo `                                            #                                                      
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo ` #                                                                                                 
echo `                           #####################################                                   
echo --`````````---------```````#((((((((///////((((/(((((((((////////#                                  
echo `                         #(//                                 \/(#                                 
echo --`````````---------``````#(/   ##            ##     #####   ## \(#   #####                         
echo ..`````````.........``````#(                        #.....###    (####.....#                        
echo --`````````--------###````#(       ##               #........######........#                        
echo ccCCCCCCCCCccccccc#(.*#####(                  ##   #........................#                       
echo --`````````-------##(((...#(   ##                  #........................#                       
echo mmMMMMMMMMMmmmmmmmm**##(((#(                       #..... #........... #....#                       
echo --`````````---------``*####(         ##     ##     #.....#@...........#@....#                       
echo ..`````````.........``````#(\  ##                  #\.......#...#...#....../#                   #   
echo --`````````---------``````#//\                      #\......*#######*...../#                        
echo ############################////(///((((/////((((((((###\............../###                         
echo --`````````---------```#/.(./##########################################                             
echo `                      #/.(/#/#(..(#                   #/..(#   #/..(#                              
echo `                      #####  *#####                   *#####   *#####                              
echo `                                                                                                   
echo `                                                          #                                        
echo `                                                          #                                        
echo `           #                                                                                       
echo `                                                     ###  #   ###                                  
echo `                                                                                                   
echo `                                                          #                                        
ping localhost -n 1 >nul
cls 

::FRAME 3
COLOR A
echo.
echo ллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл= Nyanya =лллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл
echo `                                      #                                                            
echo `                                  ###   ###                                                        
echo `                                      #                                                            
echo `                                      #                                                            
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `##                                                                                                 
echo `                                                                                                  
echo ``---------`````````--------#####################################                                   
echo `                          #(((((((((///////((((/(((((((((///////#                                  
echo ``---------`````````------#(//                                 \/(#                                 
echo ''---------'''''''''------#(/   ##            ##     #####   ## \(#   #####                         
echo ``---------`````````------#(                        #.....###    (####.....#                        
echo CCcccccccccCCCCCCCCCcccccc#(       ##               #        ######........#                        
echo ``---------`````````--,####(                  ##   #........................#                       
echo MMmmmmmmmmmMMMMMMM,,##....#(   ##                  #........................#                       
echo ``---------``````##..(((((#(                       #..... #........... #....#                       
echo ''---------''''''#(((,#####(         ##     ##     #.....#@...........#@....#                #      
echo ``---------```````###-----#(\  ##                  #\.......#...#...#....../#              #   #    
echo ###########################//\                      #\......*#######*...../#                 #      
echo ``---------`````````------##////(///((((/////((((((((###\............../###                         
echo `                         #(.##########################################                             
echo `                         #/.#  #(.(#                  #/..(#   #/..(#                             
echo `                         ###   *#####                  *#####   *#####                             
echo `                                                       #                                           
echo `        #                                          #       #                                       
echo `      #   #                                                                                        
echo `        #                                        #           #                                     
echo `                                                                                                   
echo `                                                   #       #                                       
ping localhost -n 1 >nul
cls 

::FRAME 3
COLOR 2
echo.
echo ллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл= Nyanya =лллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл
echo `                                      #                                                            
echo `                                  ###   ###                                                        
echo `                                      #                                                            
echo `                                      #                                                            
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `##                                                                                                 
echo `                                                                                                  
echo ``---------`````````--------#####################################                                   
echo `                          #((((((((///////((((/(((((((((////////#                                  
echo ``---------`````````------#(//                                 \/(#                                 
echo ''---------'''''''''------#(/   ##            ##     #####   ## \(#   #####                         
echo ``---------`````````------#(                        #.....###    (####.....#                        
echo CCcccccccccCCCCCCCCCcccccc#(       ##               #........######........#                        
echo ``---------`````````--,####(                  ##   #........................#                       
echo MMmmmmmmmmmMMMMMMM,,##....#(   ##                  #........................#                       
echo ``---------``````##..(((((#(                       #..... #........... #....#                       
echo ''---------''''''#(((,#####(         ##     ##     #.....#@...........#@....#                #      
echo ``---------```````###-----#(\  ##                  #\.......#...#...#....../#              #   #    
echo ###########################//\                      #\......*#######*...../#                 #      
echo ``---------`````````------##////(///((((/////((((((((###\............../###                         
echo `                         #(.##########################################                             
echo `                         #/.#  #(.(#                  #/..(#   #/..(#                             
echo `                         ###   *#####                  *#####   *#####                             
echo `                                                       #                                           
echo `        #                                          #       #                                       
echo `      #   #                                                                                        
echo `        #                                        #           #                                     
echo `                                                                                                   
echo `                                                   #       #                                       
ping localhost -n 1 >nul
cls 


:FRAME 4
COLOR 4
echo.
echo ллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл= Nyanya =лллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл
echo `                                                                                             
echo `                           ###  #  ###                                                        
echo `                                                                                             
echo `                                #                                                            
echo `                                #                                                    #             
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                  
echo ``---------`````````--------#####################################                                   
echo `                          #((((((((///////((((/(((((((((////////#                                  
echo ``---------`````````------#(//                                 \/(#                                 
echo ''---------'''''''''------#(/   ##            ##     #####   ## \(#   #####                         
echo ``---------`````````------#(                        #.....###    (####.....#                        
echo CCcccccccccCCCCCCCCCcccccc#(       ##               #........######........#                        
echo ``---------`````````--,####(                  ##   #........................#                       
echo MMmmmmmmmmmMMMMMMM,,##....#(   ##                  #........................#                       
echo ``---------``````##..(((((#(                       #..... #........... #....#                       
echo ''---------''''''#(((,#####(         ##     ##     #.....#@...........#@....#          #      
echo ``---------```````###-----#(\  ##                  #\.......#...#...#....../#        #   #    
echo ###########################//\                      #\......*#######*...../#           #      
echo ``---------`````````------##////(///((((/////((((((((###\............../###                         
echo `                        ,#(.##########################################                             
echo `                      #/.(.#/#(..(#                   #/..(#   #/..(#                              
echo `                      #####  *#####                   *#####   *#####                              
echo `  #                                              #                                                 
echo `  #                                                                                      #         
echo `#   ###                                                                                            
echo `  #                                        #           #                                           
echo `  #                                                                                                
echo `                                                                                                   
ping localhost -n 1 >nul
cls 

:FRAME 4
color 3
echo.
echo ллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл= Nyanya =лллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл
echo `                                                                                             
echo `                           ###  #  ###                                                        
echo `                                                                                             
echo `                                #                                                            
echo `                                #                                                    #             
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                  
echo ``---------`````````--------#####################################                                   
echo `                          #((((((((///////((((/(((((((((////////#                                  
echo ``---------`````````------#(//                                 \/(#                                 
echo ''---------'''''''''------#(/   ##            ##     #####   ## \(#   #####                         
echo ``---------`````````------#(                        #.....###    (####.....#                        
echo CCcccccccccCCCCCCCCCcccccc#(       ##               #........######........#                        
echo ``---------`````````--,####(                  ##   #........................#                       
echo MMmmmmmmmmmMMMMMMM,,##....#(   ##                  #........................#                       
echo ``---------``````##..(((((#(                       #..... #........... #....#                       
echo ''---------''''''#(((,#####(         ##     ##     #.....#@...........#@....#          #      
echo ``---------```````###-----#(\  ##                  #\.......#...#...#....../#        #   #    
echo ###########################//\                      #\......*#######*...../#           #      
echo ``---------`````````------##////(///((((/////((((((((###\............../###                         
echo `                        ,#(.##########################################                             
echo `                      #/.(.#/#(..(#                   #/..(#   #/..(#                              
echo `                      #####  *#####                   *#####   *#####                              
echo `  #                                              #                                                 
echo `  #                                                                                      #         
echo `#   ###                                                                                            
echo `  #                                        #           #                                           
echo `  #                                                                                                
echo `                                                                                                   
ping localhost -n 1 >nul
cls 


::FRAME 5
color 1
echo.
echo ллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл= Nyanya =лллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл
echo `                                                                                                   
echo `                                                                          #                        
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                  
echo `                  #                                                                                
echo `                           #####################################                                   
echo --`````````---------```````#((((((((///////((((/(((((((((////////#                                  
echo `                         #(//                       #####     \/(#   #####                         
echo --`````````---------``````#(/   ##            ##    #.....###   \(####.....#                        
echo ..`````````.........``````#(                        #........######........#                        
echo --`````````--------###````#(       ##              #........................#                       
echo ccCCCCCCCCCccccccc#(.*#####(                  ##   #........................#                       
echo --`````````-------##(((...#(   ##                  #..... #........... #....#                       
echo mmMMMMMMMMMmmmmmmmm**##(((#(                       #.....#@...........#@....#                       
echo --`````````---------``*####(         ##     ##     #\.......#...#...#....../#                       
echo ..`````````.........``````#(\  ##                   #\......*#######*...../# ###                
echo --`````````---------``````#//\                      ###\............../### #                        
echo ############################////(///((((/////((((((((/#################    #                     
echo --`````````---------``#(/..(/#####################################,,                              
echo `                     #(..(##/#(..(#                  #/..(#   #/..(#                               
echo `                     #####   #####*                  *#####   *####*                               
echo `                                                                                                   
echo `                                 #                                                                 
echo `                             #       #                                                             
echo `                                                                                                   
echo `                          #             #                                     #                    
echo `                                                                                                   
echo `                             #       #                                                             
ping localhost -n 1 >nul
cls 

::FRAME 5
echo.
echo ллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл= Nyanya =лллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл
echo `                                                                                                   
echo `                                                                          #                        
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                   
echo `                                                                                                  
echo `                  #                                                                                
echo `                           #####################################                                   
echo --`````````---------```````#((((((((///////((((/(((((((((////////#                                  
echo `                         #(//                       #####     \/(#   #####                         
echo --`````````---------``````#(/   ##            ##    #.....###   \(####.....#                        
echo ..`````````.........``````#(                        #........######........#                        
echo --`````````--------###````#(       ##              #........................#                       
echo ccCCCCCCCCCccccccc#(.*#####(                  ##   #........................#                       
echo --`````````-------##(((...#(   ##                  #..... #........... #....#                       
echo mmMMMMMMMMMmmmmmmmm**##(((#(                       #.....#@...........#@....#                       
echo --`````````---------``*####(         ##     ##     #\.......#...#...#....../#                       
echo ..`````````.........``````#(\  ##                   #\......*#######*...../# ###                
echo --`````````---------``````#//\                      ###\............../### #                        
echo ############################////(///((((/////((((((((/#################    #                     
echo --`````````---------``#(/..(/#####################################,,                              
echo `                     #(..(##/#(..(#                  #/..(#   #/..(#                               
echo `                     #####   #####*                  *#####   *####*                               
echo `                                                                                                   
echo `                                 #                                                                 
echo `                             #       #                                                             
echo `                                                                                                   
echo `                          #             #                                     #                    
echo `                                                                                                   
echo `                             #       #                                                             
ping localhost -n 1 >nul
cls 

goto :loop
 